1. Структура веб-ресурса представляет собой его план. В свою очередь, она разделяется на внутреннюю и внешнюю.
2.'Тело' сайта - это всё, что есть на страницы, включая главный контент. 
3. Внутри 'Тела' лежит контент, который состоит из заголовкой статьи, самого текса, картиной и вложенных ссылок.  
4. Также есть боковое меню - некое содержание, состоящее из ссылок на другие материалы, тех поддержку, инструметны для разработчиков, инструменты для печати или экспорта, статьи на других языках. 
5. Далее мы видим указание партнёров. 
6. В самом низу - информация о копирайтах, конфидециальности, куки и прочих важных вещах. 
